tests/integration/bajaj/test_data/container_tracker.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://local.bajaj.gladminds.co:8000/api/v1/feed/">
  <SOAP-ENV:Body>
        <ns1:postContainerTracker>
            <ns1:ObjectList>
                <ns1:ContainerTrackerData>
                    <ns1:ContainerTrackerModel>
                        <ns1:GATEIN_TIME>00:00:00</ns1:GATEIN_TIME>
                        <ns1:ZIB_INDENT_NUM>TEST001</ns1:ZIB_INDENT_NUM>
                        <ns1:SEAL_NO></ns1:SEAL_NO>
                        <ns1:PARTNER_NAME>partner1</ns1:PARTNER_NAME>
                        <ns1:CONSIGNMENT_ID>TEST001</ns1:CONSIGNMENT_ID>
                   		<ns1:CREATED_DATE>0000-00-00</ns1:CREATED_DATE>
                        <ns1:TRANSPORTER_ID>15346</ns1:TRANSPORTER_ID>
                        <ns1:LR_NUMBER>111</ns1:LR_NUMBER>
                        <ns1:TRANS_NAME>trans pvt ltd</ns1:TRANS_NAME>
                   		<ns1:CONTAINER_NO>123</ns1:CONTAINER_NO>
                 		<ns1:LR_DATE>2015-03-04</ns1:LR_DATE>
                   		<ns1:SHIPPINGLINE_ID></ns1:SHIPPINGLINE_ID>
                   		<ns1:DO_NUM>1</ns1:DO_NUM>
                        <ns1:TRUCK_NO>45</ns1:TRUCK_NO>
                        <ns1:NO_OF_CONTAINERS>3</ns1:NO_OF_CONTAINERS>
                        <ns1:GATEIN_DATE>0000-00-00</ns1:GATEIN_DATE>    
                        <ns1:IB_DISPATCH_DT>0000-00-00</ns1:IB_DISPATCH_DT>
                    </ns1:ContainerTrackerModel>
                    <ns1:ContainerTrackerModel>
                        <ns1:GATEIN_TIME>00:00:00</ns1:GATEIN_TIME>
                        <ns1:ZIB_INDENT_NUM>TEST001</ns1:ZIB_INDENT_NUM>
                        <ns1:SEAL_NO>123</ns1:SEAL_NO>
                        <ns1:PARTNER_NAME>partner1</ns1:PARTNER_NAME>
                        <ns1:CONSIGNMENT_ID>TEST001</ns1:CONSIGNMENT_ID>
                        <ns1:CREATED_DATE>0000-00-00</ns1:CREATED_DATE>
                        <ns1:TRANSPORTER_ID>15346</ns1:TRANSPORTER_ID>
                        <ns1:LR_NUMBER>222</ns1:LR_NUMBER>
                        <ns1:TRANS_NAME>trans pvt ltd</ns1:TRANS_NAME>
                        <ns1:CONTAINER_NO>123</ns1:CONTAINER_NO>
                        <ns1:LR_DATE>2015-03-04</ns1:LR_DATE>
                        <ns1:SHIPPINGLINE_ID></ns1:SHIPPINGLINE_ID>
                        <ns1:DO_NUM>1</ns1:DO_NUM>
                        <ns1:TRUCK_NO>45</ns1:TRUCK_NO>
                        <ns1:NO_OF_CONTAINERS>3</ns1:NO_OF_CONTAINERS>
                        <ns1:GATEIN_DATE>0000-00-00</ns1:GATEIN_DATE>    
                        <ns1:IB_DISPATCH_DT>0000-00-00</ns1:IB_DISPATCH_DT>
                    </ns1:ContainerTrackerModel>
                    <ns1:ContainerTrackerModel>
                        <ns1:GATEIN_TIME>00:00:00</ns1:GATEIN_TIME>
                        <ns1:ZIB_INDENT_NUM>TEST001</ns1:ZIB_INDENT_NUM>
                        <ns1:SEAL_NO>123</ns1:SEAL_NO>
                        <ns1:PARTNER_NAME>partner1</ns1:PARTNER_NAME>
                        <ns1:CONSIGNMENT_ID>TEST001</ns1:CONSIGNMENT_ID>
                        <ns1:CREATED_DATE>0000-00-00</ns1:CREATED_DATE>
                        <ns1:TRANSPORTER_ID>15346</ns1:TRANSPORTER_ID>
                        <ns1:LR_NUMBER>333</ns1:LR_NUMBER>
                        <ns1:TRANS_NAME>trans pvt ltd</ns1:TRANS_NAME>
                        <ns1:CONTAINER_NO>123</ns1:CONTAINER_NO>
                        <ns1:LR_DATE>2015-03-04</ns1:LR_DATE>
                        <ns1:SHIPPINGLINE_ID></ns1:SHIPPINGLINE_ID>
                        <ns1:DO_NUM>1</ns1:DO_NUM>
                        <ns1:TRUCK_NO>45</ns1:TRUCK_NO>
                        <ns1:NO_OF_CONTAINERS>3</ns1:NO_OF_CONTAINERS>
                        <ns1:GATEIN_DATE>2015-03-02</ns1:GATEIN_DATE>    
                        <ns1:IB_DISPATCH_DT>0000-00-00</ns1:IB_DISPATCH_DT>
                    </ns1:ContainerTrackerModel>
                    <ns1:ContainerTrackerModel>
                        <ns1:GATEIN_TIME>00:00:00</ns1:GATEIN_TIME>
                        <ns1:ZIB_INDENT_NUM>TEST002</ns1:ZIB_INDENT_NUM>
                        <ns1:SEAL_NO>123</ns1:SEAL_NO>
                        <ns1:PARTNER_NAME>partner1</ns1:PARTNER_NAME>
                        <ns1:CONSIGNMENT_ID>TEST002</ns1:CONSIGNMENT_ID>
                        <ns1:CREATED_DATE>0000-00-00</ns1:CREATED_DATE>
                        <ns1:TRANSPORTER_ID>56789</ns1:TRANSPORTER_ID>
                        <ns1:LR_NUMBER>333</ns1:LR_NUMBER>
                        <ns1:TRANS_NAME>trans new pvt ltd</ns1:TRANS_NAME>
                        <ns1:CONTAINER_NO>123</ns1:CONTAINER_NO>
                        <ns1:LR_DATE>2015-03-04</ns1:LR_DATE>
                        <ns1:SHIPPINGLINE_ID>123</ns1:SHIPPINGLINE_ID>
                        <ns1:DO_NUM>1</ns1:DO_NUM>
                        <ns1:TRUCK_NO>45</ns1:TRUCK_NO>
                        <ns1:NO_OF_CONTAINERS>1</ns1:NO_OF_CONTAINERS>
                        <ns1:GATEIN_DATE>0000-00-00</ns1:GATEIN_DATE>    
                        <ns1:IB_DISPATCH_DT>0000-00-00</ns1:IB_DISPATCH_DT>
                    </ns1:ContainerTrackerModel>
                </ns1:ContainerTrackerData>
            </ns1:ObjectList>
            <ns1:Credential>
                <ns1:UserName>bajaj</ns1:UserName>
                <ns1:Password>bajaj</ns1:Password>
            </ns1:Credential>
        </ns1:postContainerTracker>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>